import React from 'react'
import icons_left from '../img/icons-left.png'
import icons_right from '../img/icons-right.png'
import users_icon from '../img/users.png'
import notifications_icon from '../img/notifications.png'
import chart_icon from '../img/chart.png'
import phone_icon_left from '../img/phone-left.png'
import phone_icon_right from '../img/phone-right.png'
import tablet_image from '../img/tablet.png'
import icons_mobile from '../img/icons-mobile.png'
import { Link } from 'react-router-dom';

function Landing() {
  return (
    <div>
        <header>
            <div className='container'>
                <nav className='nav-landing'>
                    <div className='logo-landing'></div>
                    <div className='auth-buttons'>
                        <Link to="/signup">
                        <button className='btn-a'>Зарегистрироваться</button>
                        </Link>
                        <Link to="/login">
                        <button className='btn-b'>Войти</button>
                        </Link>
                    </div>
                </nav>
                <div className='description_block'>
                    <img src={icons_left} alt='' className='icons_desktop'></img>
                    <div className='main-text'>
                        <img src={icons_mobile} alt='' className='icons_mobile'></img>
                        <h1>Viva: Креативность вместо Рутины.</h1>
                        <p>Простой, интеллектуальный и эффективный инструмент для профессионалов красоты. Ведите свой бизнес как профессионал.</p>
                        <button className='btn-gradient'>Попробовать Сейчас</button>
                    </div>
                    <img src={icons_right} alt='' className='icons_desktop'></img>
                </div>
                <div className='benefits_block'>
                    <div className='benefits_card'>
                        <svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 50 50" fill="none">
                        <path d="M24.9998 11.25C24.3095 11.25 23.7498 11.8097 23.7498 12.5V24.2285L16.9849 27.6343C16.5637 27.8465 16.2979 28.2777 16.2975 28.7494C16.297 29.4397 16.8562 29.9995 17.5464 30C17.7415 30.0009 17.9341 29.9548 18.1078 29.8657L25.5614 26.1157C25.9833 25.9038 26.2495 25.4721 26.2498 25V12.5C26.2498 11.8097 25.6903 11.25 24.9998 11.25ZM25 0C11.1929 0 0 11.1929 0 25C0 38.8071 11.1929 50 25 50C38.8004 49.9838 49.9838 38.8004 50 25C50 11.1929 38.8071 0 25 0ZM25 47.5C12.5735 47.5 2.5 37.4265 2.5 25C2.5 12.5735 12.5735 2.5 25 2.5C37.4208 2.51358 47.4864 12.5792 47.5 25C47.5 37.4265 37.4265 47.5 25 47.5Z" fill="url(#paint0_linear_44_48)"/>
                        <defs>
                            <linearGradient id="paint0_linear_44_48" x1="25" y1="0" x2="25" y2="50" gradientUnits="userSpaceOnUse">
                            <stop stopColor="#A23BCC"/>
                            <stop offset="1" stopColor="#4E0A7A"/>
                            </linearGradient>
                        </defs>
                        </svg>
                        <p>Экономьте время с удобным расписанием, контролируйте свое рабочее время без усилий.</p>
                    </div>
                    <div className='benefits_card_main'>
                        <svg xmlns="http://www.w3.org/2000/svg" width="60" height="60" viewBox="0 0 60 60" fill="none">
                        <path d="M58.3205 2.31882C58.1916 2.02579 57.9573 1.79136 57.6761 1.67415C57.5238 1.60382 42.5262 -4.70226 30.1883 7.62859C27.8332 9.98458 25.5601 12.7625 23.4745 15.6929L20.6273 15.0365C16.3273 14.0402 11.8983 15.3061 8.76988 18.4239L1.0016 26.2069C-1.06057 28.2699 0.263435 31.7746 3.13407 31.9973L14.0776 32.8764C13.5972 34.154 13.1871 35.4082 12.9528 36.2404C12.7419 36.9788 12.777 37.7407 12.9997 38.444C11.0195 38.9832 9.21512 39.9678 8.19575 40.9875C5.94612 43.2263 3.94253 53.0371 3.56759 54.9828C3.40355 55.9205 4.23545 56.6355 5.0322 56.448C6.9772 56.0612 16.7842 54.0568 19.0221 51.818C20.0884 50.7514 21.0492 48.9229 21.5764 47.0123C22.3263 47.2467 23.0879 47.2467 23.7792 47.0475H23.7909C24.6228 46.813 25.8414 46.4262 27.1419 45.9222L28.0207 56.8699C28.2433 59.7417 31.7584 61.0545 33.8088 59.0032L41.5888 51.2203C44.7055 48.1024 45.9826 43.66 44.975 39.3583L44.3189 36.51C47.2481 34.4236 50.025 32.1496 52.3801 29.7936C64.7062 17.4745 58.3908 2.4712 58.3205 2.31882ZM2.78256 27.9768L10.5508 20.1939C13.07 17.6738 16.6319 16.6657 20.0649 17.4745L21.9514 17.9082C19.151 22.1162 16.7842 26.5234 15.0736 30.4383L3.33325 29.5006C2.57166 29.4303 2.24359 28.5043 2.78256 27.9768ZM17.2529 50.0598C16.1632 51.1499 10.7617 52.662 6.40307 53.6231C7.35214 49.2511 8.86361 43.8593 9.965 42.7692C10.9141 41.808 12.7653 40.9758 14.5697 40.6476L19.3736 45.4534C19.3619 45.5002 19.3619 45.5471 19.3502 45.6057C18.9987 47.3288 18.1434 49.169 17.2529 50.0598ZM21.7522 44.2812L15.7297 38.2565C15.3782 37.9048 15.2376 37.3774 15.3665 36.9085C15.4719 36.5451 15.6711 35.8653 15.9289 35.1034L24.904 44.082C24.365 44.2695 23.6503 44.4922 23.0996 44.6446C22.6309 44.7852 22.1154 44.6446 21.7522 44.2812ZM42.5262 39.9443C43.3229 43.4021 42.3153 46.9537 39.8079 49.4621L32.0279 57.245C31.4889 57.7842 30.575 57.4443 30.5047 56.6941L29.5673 44.9493C33.4808 43.2497 37.8863 40.8703 42.0926 38.0689L42.5262 39.9443ZM27.47 43.1091L16.8897 32.5247C19.8775 25.2223 25.5836 15.7632 31.9458 9.39851C39.2103 2.13128 48.7595 1.04119 56.1998 3.78399C57.0785 6.24547 60.5701 18.0723 50.5874 28.0589C44.2251 34.4236 34.7696 40.1319 27.47 43.1091Z" fill="white"/>
                        <path d="M36.4588 11.2414C33.0645 14.6357 33.0645 20.1351 36.4588 23.5412C39.8531 26.9355 45.3525 26.9355 48.7586 23.5412C52.1529 20.1469 52.1529 14.6357 48.7586 11.2414C45.3525 7.84708 39.8531 7.84708 36.4588 11.2414ZM46.9728 21.7554C44.5601 24.1681 40.6573 24.1681 38.2446 21.7554C35.832 19.3427 35.832 15.4399 38.2446 13.0272C40.6573 10.6145 44.5601 10.6145 46.9728 13.0272C49.3736 15.4399 49.3736 19.3546 46.9728 21.7554Z" fill="white"/>
                        </svg>
                        <p>Мгновенный Рост Бизнеса. Наш сервис моментально оптимизирует работу и поднимает ваш бизнес на новый уровень.</p>
                    </div>
                    <div className='benefits_card'>
                        <svg xmlns="http://www.w3.org/2000/svg" width="40" height="50" viewBox="0 0 40 50" fill="none">
                        <path d="M24.3067 19.956L16.8232 27.4393L13.7627 24.3764C13.2854 23.9085 12.5213 23.9085 12.0438 24.3764C11.5595 24.8511 11.5517 25.6286 12.0263 26.1129L15.9551 30.0441C16.1854 30.2745 16.4976 30.4039 16.8234 30.4039C17.149 30.4039 17.4612 30.2745 17.6915 30.0441L26.0608 21.6749C26.5354 21.1905 26.5276 20.4129 26.0432 19.9383C25.5589 19.4637 24.7814 19.4715 24.3067 19.956ZM39.2718 4.74551C39.1328 4.08142 38.4819 3.65568 37.8178 3.79449C31.7531 5.07516 25.429 3.7819 20.354 0.223064C19.931 -0.0743548 19.3667 -0.0743548 18.9437 0.223064C13.8688 3.78205 7.54461 5.07546 1.4799 3.79449C1.39745 3.77725 1.3135 3.76856 1.22925 3.76856C0.550765 3.76811 0.000449713 4.31767 0 4.99616V24.6906C0.00404742 31.9023 3.47594 38.6721 9.33033 42.8835L18.9341 49.7697C19.1423 49.9196 19.3924 50.0003 19.6489 50C19.9053 50.0003 20.1554 49.9198 20.3636 49.7699L29.9674 42.8835C35.8218 38.6721 39.2937 31.9023 39.2977 24.6906V4.99616C39.2977 4.91191 39.289 4.82796 39.2718 4.74551ZM36.8416 24.6906C36.8389 31.1107 33.749 37.138 28.5378 40.8879L19.6489 47.2609L10.7599 40.8879C5.54873 37.1378 2.4588 31.1107 2.45611 24.6906V6.46407C8.45336 7.35993 14.5708 6.02439 19.6489 2.71035C24.7273 6.02349 30.8445 7.35903 36.8416 6.46407V24.6906Z" fill="url(#paint0_linear_44_56)"/>
                        <defs>
                        <linearGradient id="paint0_linear_44_56" x1="19.6489" y1="0" x2="19.6489" y2="50" gradientUnits="userSpaceOnUse">
                        <stop stopColor="#A23BCC"/>
                        <stop offset="1" stopColor="#4E0A7A"/>
                        </linearGradient>
                        </defs>
                        </svg>
                        <p>Безопасность ваших данных – работайте спокойно, ваша конфиденциальность под надежной защитой.</p>
                    </div>
                </div>
            </div>
        </header>
        <main>
            <section className='instruments'>
                <div className='container'>
                    <h2>Лучшие Инструменты в Одном Месте:</h2>
                    <div className='instruments_block'>
                        <div className='instrument_card'>
                            <img src={users_icon} alt=''></img>
                            <h3>Клиентская База Данных</h3>
                            <p>Ведите подробную базу данных клиентов с историей визитов и предпочтений для более персонализированного обслуживания.</p>
                        </div>
                        <div className='instrument_card'>
                            <img src={notifications_icon} alt=''></img>
                            <h3>Мгновенные Уведомления</h3>
                            <p>Получайте мгновенные уведомления о новых записях, изменениях или сообщениях от клиентов.</p>
                        </div>
                        <div className='instrument_card'>
                            <img src={chart_icon} alt=''></img>
                            <h3>Статистика и Аналитика</h3>
                            <p>Отслеживайте ключевые метрики бизнеса, анализируйте данные и принимайте информированные решения для развития.</p>
                        </div>
                    </div>
                    <div className='more_instruments'>
                    <img src={phone_icon_left} alt='' className='phone_icon_left'></img>
                    <div className='more_instruments_text'>
                        <h3>Откройте для себя ещё больше возможностей:</h3>
                        <button className='btn-gradient'>Узнать Больше</button>
                    </div>
                    <img src={phone_icon_right} alt=''></img>
                    </div>
                </div>
            </section>
            <section className='try'>
                <div className='container'>
                    <h2>Бесплатно и Безгранично:</h2>
                    <div className='try_block'>
                        <div className='try_block_left'>
                            <p>
                            Для первых пользователей предоставляем уникальную
                            возможность воспользоваться всеми преимуществами 
                            нашего сервиса абсолютно бесплатно.
                            </p>
                            <ul>
                                <li>Неограниченный доступ ко всем функциям</li>
                                <li>Безлимитное количество клиентов</li>
                                <li>Бесплатные обновления и поддержка 24/7</li>
                                <li>Мгновенный старт без карты и Полная кастомизация</li>
                                <li>Бесплатный период пробного использования</li>
                            </ul>
                        </div>
                        <div className='try_block_right'>
                            <img src={tablet_image} alt=''></img>
                        </div>
                    </div>
                    <div className='try_block_bottom'>
                        <h3>Твой успех в твоих руках!</h3>
                        <p>Не ограничивай себя – начни сегодняшний день с чего-то великого.</p>
                        <button className='btn-background'>Присоединиться сейчас</button>
                    </div>
                </div>
            </section>
        </main>
    </div>
  )
}

export default Landing